app/views/users/show.html.erb

SELECT "offers".* FROM "offers" WHERE "offers"."user_id" = $1  [["user_id", 4]]
---
<p class='item no-top-margin'><br/></p>
<% @user.offers.each do |offer| %>