app/controllers/offers_controller.rb

SELECT "offers".* FROM "offers"
---
	def index
		@offers = Offer.all

SELECT  "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "offers".* FROM "offers" WHERE "offers"."line1" = $1  [["line1", "419 Boston Ave"]]
---
	def show
		@temp_offer = Offer.find(params[:id])
		@offers = Offer.where(line1: @temp_offer.line1)

SELECT  "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT 1  [["id", 11]]
---
	def edit
		@offer = Offer.find(params[:id])

INSERT INTO "offers" ("image", "line1", "line2", "city", "state", "zip", "rent", "start_date", "end_date", "water", "electric", "gas", "heat", "internet", "washdry", "aircond", "handicap", "parking", "interested", "school", "description", "user_id", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26) RETURNING "id"
---
	def create
		@offer = current_user.offers.build(offer_params)

		if @offer.save

SELECT  "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT 1  [["id", 13]]
UPDATE "offers" SET "line1" = $1, "state" = $2, "latitude" = $3, "longitude" = $4, "updated_at" = $5 WHERE "offers"."id" = $6  [["line1", "1156 Powderhouse Blvd"], ["state", "KY"], ["latitude", 37.8393332], ["longitude", -84.2700179], ["updated_at", "2016-01-28 22:52:43.750089"], ["id", 9]]
---
	def update
		@offer = Offer.find(params[:id])

		if @offer.update(offer_params)

SELECT  "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT 1  [["id", 16]]
DELETE FROM "offers" WHERE "offers"."id" = $1  [["id", 16]]
---
	def destroy
		@offer = Offer.find(params[:id])
		@offer.destroy