app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 21]]
SELECT "users".* FROM "users"
---
	def show
		@user = User.find(params[:id])
		@users = []
		if (current_user.uid == "473418502829853")
			@users = User.all

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 23]]
---
	def destroy
		if (current_user.uid == "473418502829853")
			User.find(params[:id]).destroy